class News {
  final String title;
  final String content;
  final String  image ;

  News({required this.title, required this.content,required this.image});


   
}
final List<News> newsList = [
  News(
    title:"زيارة معالى رئيس جامعة دمنهور لكلية الحاسبات والمعلومات بالنوبارية",
    
    content:'''أجرى الأستاذ الدكتور / إلهامي ترابيس - رئيس جامعة دمنهور،  فى صباح اليوم جولة تفقدية بكليات قطاع النوبارية،
لمتابعة انتظام سير العملية التعليمية بالفصل الدراسى الأول للعام الجامعي ٢٠٢٤ـ٢٠٢٥،
 وذلك في إطار جولاته الدورية بكليات الجامعة المختلفة للاطمئنان على انتظام سير العملية التعليمية لتقديم أفضل خدمة للطلاب، وتوفير بيئة تعليمية محفزة وداعمة للتفوق والإبداع.
 خلال جولته اطمأن رئيس جامعة دمنهور على توافر وسائل الراحة للطلاب بالمدرجات وقاعات الدراسة، وتذليل أية عقبات قد تواجههم،
 مشيداً  بانتظام المحاضرات في مواعيدها وتواجد أعضاء هيئة التدريس والجهاز الإداري.
 *ترابيس يحث الطلاب على المشاركة في الأنشطة والفعاليات التي تنفذها الجامعة في إطار مبادرة بداية*
 وفي كلمته للطلاب ..  أوصى رئيس جامعة دمنهور بالاستفادة من كافة الخدمات التي تقدمها الكليات لطلابها، والمشاركة في الأنشطة الطلابية المختلفة،
 وكذا المشاركة في الفعاليات والأنشطة التي تنفذها الجامعة في إطار مبادرة "بداية"،
 والتي تساعدهم علي صقل مهاراتهم وتزويدهم بالمعارف اللازمة، إلى جانب اندماجهم مع زملائهم من الكليات المختلفة.
  نقاش مفتوح بين رئيس جامعة دمنهور وأبنائه الطلاب لاستطلاع آرائهم ومدى الرضا عن العملية التعليمية
وأجرى رئيس الجامعة نقاشاً مفتوحاً مع الطلاب، استطلع خلاله أرائهم حول مدى الرضا عن العملية التعليمية، موجهاً جميع الطلاب بضرورة الاجتهاد في الدراسة العلمية والعملية،'''
 ,
 image: "assets/images/newsDetails.svg"
  ),
  News(title: "", content: "", image: ""),
  News(title: "", content: "", image: ""),
  
];